1c_um/src/InformationRegisters/ум_ЖурналСобытийПакетовДанных/ум_ЖурналСобытийПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ЖурналСобытийПакетовДанных</name>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПопыткиОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРезультатаОбработки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВременнаяМеткаСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ПакетыДанных/ум_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанных</name>
  <resources>
    <name>ВременнаяМеткаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПакетПрипаркован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/InformationRegisters/ум_ЛогФоновыхЗаданийПакетов/ум_ЛогФоновыхЗаданийПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ЛогФоновыхЗаданийПакетов</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.ум_ВидыФЗПакетовДанных</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторРодительскогоФЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособОбработкиПакетов</name>
    <type>
      <types>CatalogRef.ум_СпособыОбработкиПакетов</types>
    </type>
  </resources>
  <attributes>
    <name>ДанныеСобытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторФЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВременнаяМеткаСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.ум_ЛогированиеСобытийФЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/Enums/ум_ВидыФЗПакетовДанных/ум_ВидыФЗПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_ВидыФЗПакетовДанных</name>
  <enumValues>
    <name>РегламентноеЗаданиеОбработкаПакетов</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗаданиеКонтрольРабочихФЗ</name>
  </enumValues>
  <enumValues>
    <name>УпровляющееФЗ</name>
  </enumValues>
  <enumValues>
    <name>РабочееФЗ</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗаданиеОбслуживаниеСистемы</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Enums/ум_СостоянияПакетаДанных/ум_СостоянияПакетаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_СостоянияПакетаДанных</name>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ум_СпособыОбработкиПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_СпособыОбработкиПакетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МногопоточноеИзменениеПакетовДанных</name>
      <description>Многопоточное изменение пакетов данных</description>
    </items>
    <items>
      <name>ОчисткаЛоговФЗ</name>
      <description>Очистка логов ФЗ</description>
    </items>
    <items>
      <name>ПакетыДанныхОбслуживание</name>
      <description>Регламентное обслуживание пакетов данных</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниУправляющегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаУправляющееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниРабочегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаРабочееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторнаяОбработкаПакетовСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПовторнойОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПакетПриУспешнойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщийСписокОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизвольныйКодОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаПроизвольногоКодаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиОбработкиПакетов</name>
    <attributes>
      <name>ОписаниеОшбики</name>
      <type>
        <types>CatalogRef.ум_ОписанияОшибокОбработкиПакетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1c_um/src/Catalogs/ум_КлючиАналитикиПакетовДанных/ум_КлючиАналитикиПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_КлючиАналитикиПакетовДанных</name>
  <attributes>
    <name>СпособОбработкиПакетов</name>
    <type>
      <types>CatalogRef.ум_СпособыОбработкиПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПакетаДанных</name>
    <type>
      <types>EnumRef.ум_СостоянияПакетаДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

1c_um/src/CommonModules/ум_ПакетыДанныхОбслуживание/Module.bsl
#Область УдалениеПакетов

// Удаление данных пакетов по их идентификаторам
// 
// Параметры:
//  МассивИДПакетов - Массив - содержит массив идентификаторов пакетов
//
// Возвращаемое значение:
//   Структура - Ошибка - булево, ОписаниеОшибки - Строка
Функция УдалитьПакетыДанныхИСвязанныеДанные(МассивИдентификаторовПакетов) Экспорт
	Перем МассивИдентификаторовРезультатаОбработки, Ошибка;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	Попытка
		
		// 1. Заблокируем пакеты и журнал пакетов  
		ум_ПакетыДанныхОбщегоНазначения.УстановитьБлокировкуРегистраПакетов("ум_ПакетыДанных", МассивИдентификаторовПакетов);
		ум_ПакетыДанныхОбщегоНазначения.УстановитьБлокировкуРегистраПакетов("ум_ЖурналСобытийПакетовДанных", МассивИдентификаторовПакетов); 
		// Блокировать регистр данных пакета нет смысла, т.к. данные пишутся всегда в одной транзакции с пакетами или связанными записями журнала
		
		// 2. Выберем данные пакетов и журнала
		МассивИдентификаторовРезультатаОбработки = ПолучитьИденитфикаторДанныхИзЖурналаСобытийПакетов(МассивИдентификаторовПакетов);
		
		// 3. Удалим данные и пакеты
		УдалитьДанныеПакетовПоИДНабором("ум_ПакетыДанных", МассивИдентификаторовПакетов);
		УдалитьДанныеПакетовПоИДНабором("ум_ПакетыДанныхДанные", МассивИдентификаторовПакетов);
		УдалитьДанныеПакетовПоИДНабором("ум_ПакетыДанныхДанные", МассивИдентификаторовРезультатаОбработки);
		УдалитьДанныеЖурналСобытийПакетовДанных(МассивИдентификаторовПакетов);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Возврат Новый Структура("Ошибка, ОписаниеОшибки", Истина, ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Новый Структура("Ошибка, ОписаниеОшибки", Ложь, "");
	
КонецФункции

Функция ПолучитьИденитфикаторДанныхИзЖурналаСобытийПакетов(МассивИдентификаторовПакетов)
	
	МассивИд = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ум_ЖурналСобытийПакетовДанных.ИдентификаторРезультатаОбработки
	|ИЗ
	|	РегистрСведений.ум_ЖурналСобытийПакетовДанных КАК ум_ЖурналСобытийПакетовДанных
	|ГДЕ
	|	ум_ЖурналСобытийПакетовДанных.ИдентификаторПакета В(&МассивИдентификаторовПакетов)
	|	И ум_ЖурналСобытийПакетовДанных.ИдентификаторРезультатаОбработки <> &ПустойУникальныйИдентификатор";
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ум_ПакетыДанныхОбщегоНазначения.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("МассивИдентификаторовПакетов", МассивИдентификаторовПакетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивИд.Добавить(ВыборкаДетальныеЗаписи.ИдентификаторРезультатаОбработки);
	КонецЦикла;
	
	Возврат МассивИд;
	
КонецФункции

Процедура УдалитьДанныеПакетовПоИДНабором(ИмяРегистраПакета, МассивИдентификаторовПакетов)
	Если МассивИдентификаторовПакетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборУдалить = РегистрыСведений[ИмяРегистраПакета].СоздатьНаборЗаписей();
	
	Для каждого ИДРезультатаОбработки Из МассивИдентификаторовПакетов Цикл
		ЗаписьУдалить = НаборУдалить.Добавить();
		ЗаписьУдалить.ИдентификаторПакета = ИДРезультатаОбработки;
	КонецЦикла;
	
	Если НаборУдалить.Количество() Тогда
		НаборУдалить.Записать(РежимЗамещения.Удаление);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДанныеЖурналСобытийПакетовДанных(МассивИдентификаторовПакетов)
	
	Если МассивИдентификаторовПакетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборУдалить = РегистрыСведений.ум_ЖурналСобытийПакетовДанных.СоздатьНаборЗаписей();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ум_ЖурналСобытийПакетовДанных.ИдентификаторПакета КАК ИдентификаторПакета,
		|	ум_ЖурналСобытийПакетовДанных.ВременнаяМеткаСобытия КАК ВременнаяМеткаСобытия
		|ИЗ
		|	РегистрСведений.ум_ЖурналСобытийПакетовДанных КАК ум_ЖурналСобытийПакетовДанных
		|ГДЕ
		|	ум_ЖурналСобытийПакетовДанных.ИдентификаторПакета В(&ИдентификаторПакета)";
	
	Запрос.УстановитьПараметр("ИдентификаторПакета", МассивИдентификаторовПакетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаписьУдалить = НаборУдалить.Добавить();
		ЗаписьУдалить.ИдентификаторПакета = ВыборкаДетальныеЗаписи.ИдентификаторПакета;
		ЗаписьУдалить.ВременнаяМеткаСобытия = ВыборкаДетальныеЗаписи.ВременнаяМеткаСобытия;
	КонецЦикла;
	
	Если НаборУдалить.Количество() Тогда
		НаборУдалить.Записать(РежимЗамещения.Удаление);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // УдалениеПакетов

#Область РегламентноеУдалениеПакетов

// Обработчик регламентного задания "ум_МногопоточныйКонвейерОбслуживаниеСистемы" (Многопоточный конвейер: обслуживание системы)
Процедура ПакетыДанныхОбслуживание() Экспорт
	Перем ДатаСледующейОбработкиПакета;
	
	ИдентификаторТекущегоФЗ = ум_ЛогированиеПакетыДанных.УникальныйИдентификаторТекущегоФЗ();
	ВидыФЗ = Перечисления.ум_ВидыФЗПакетовДанных.РегламентноеЗаданиеОбслуживаниеСистемы;
	ум_ЛогированиеПакетыДанных.ЗаписатьСтарт(ИдентификаторТекущегоФЗ, ВидыФЗ);
	
	СпособПакетыДанныхОбслуживание = Справочники.ум_СпособыОбработкиПакетов.ПакетыДанныхОбслуживание; 
	Если ум_ПакетыДанныхОбщегоНазначения.ЕстьНеобработанныеПакетыПоСпособуОбработки(СпособПакетыДанныхОбслуживание) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ум_ПакетыДанных.ИдентификаторПакета КАК ИдентификаторПакета
	|ИЗ
	|	(ВЫБРАТЬ
	|		ум_КлючиАналитикиПакетовДанных.Ссылка КАК КлючАналитикиПакетаДанных,
	|		ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов.ТаймаутУдаленияПакета КАК ТаймаутУдаленияПакета
	|	ИЗ
	|		Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
	|	ГДЕ
	|		ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов.УдалятьПакетПриУспешнойОбработке
	|		И ум_КлючиАналитикиПакетовДанных.СостояниеПакетаДанных = ЗНАЧЕНИЕ(Перечисление.ум_СостоянияПакетаДанных.Обработан)) КАК КлючиАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|		ПО (ум_ПакетыДанных.КлючАналитикиПакетаДанных = КлючиАналитики.КлючАналитикиПакетаДанных)
	|ГДЕ
	|	НЕ ум_ПакетыДанных.ПакетПрипаркован
	|	И ДОБАВИТЬКДАТЕ(ум_ПакетыДанных.ДатаОбработкиПакета, ЧАС, КлючиАналитики.ТаймаутУдаленияПакета) <= &ДатаСеанса";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("ДатаСеанса", ТекущаяДатаСеанса());
	ТаблицаЗаданий  = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗаданий.Количество() > 0 Тогда
	
		РазмерНарезки = 1000;
		МассивТаблицПакетов = ум_ОбщегоНазначенияКлиентСервер.РазбитьТаблицу(ТаблицаЗаданий, РазмерНарезки);
		
		Для каждого ТаблицаПакета Из МассивТаблицПакетов Цикл 
			МассивИДПакетовНаУдаление = ТаблицаПакета.ВыгрузитьКолонку("ИдентификаторПакета");
			КоличествоПакетов = ТаблицаПакета.Количество(); 
			
			ум_ПакетыДанных.СоздатьПакетДанных(МассивИДПакетовНаУдаление,
												СпособПакетыДанныхОбслуживание,
												ДатаСледующейОбработкиПакета,
												"Удаление обработанных пакетов по таймауту",
												"Количество пакетов: " + КоличествоПакетов
			);
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеСобытия = Новый Структура("Комментарий", "Созадано задание на удаление" + ТаблицаЗаданий.Количество() + " пакетов.");
	ум_ЛогированиеПакетыДанных.ЗаписатьОкончание(ИдентификаторТекущегоФЗ, ВидыФЗ,,,ДанныеСобытия);
	
	СоздатьПакетНаОчисткуЛоговФЗ();
КонецПроцедуры // ПакетыДанныхОбслуживание()

//////////////////////////////////////////////////////////////////////////
// Функция способа обработки пакетов "Регламентное обслуживание пакетов даных". Удаление выполненных пакетов 
//
// Параметры:
//		МассивИДПакетов - Массив - содержит массив идентификаторов пакетов
//		ПараметрыПакетаДанных - Структура - необязательный параметр. Параметры Пакета Данных
//		ПараметрыСпособаОбработки - Структура - необязательный параметр. Параметры способа обработки пакетов
//
// Возвращаемое значение:
//		Структура - СостояниеПакетаДанных (Перечисления.ум_СостоянияПакетаДанных) , Сообщение - Строка - время обработки
Функция ПакетыДанныхОбслуживание_ОбработкаПакета(МассивИДПакетов,
												 ПараметрыПакетаДанных = Неопределено,
												 ПараметрыСпособаОбработки = Неопределено) Экспорт
	
	Результат = УдалитьПакетыДанныхИСвязанныеДанные(МассивИДПакетов);
	
	Если Результат.Ошибка Тогда
		ВызватьИсключение Результат.ОписаниеОшибки;
	Иначе
		Возврат Новый Структура("СостояниеПакетаДанных, Сообщение", Перечисления.ум_СостоянияПакетаДанных.Обработан, "");
	КонецЕсли;
	
КонецФункции


Процедура СоздатьПакетНаОчисткуЛоговФЗ()
	ПараметрыУдаленияЛоговФЗ = ум_ПакетыДанныхПовтИсп.ПолучитьНастройкиЛогированияФЗ(); 
	
	МеткаВремениОчистки = ТекущаяУниверсальнаяДатаВМиллисекундах() - ПараметрыУдаленияЛоговФЗ.ТаймаутУдаленияЛоговФЗ * 3600 * 1000;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.ум_ЛогФоновыхЗаданийПакетов КАК ум_ЛогФоновыхЗаданийПакетов
		|ГДЕ
		|	ум_ЛогФоновыхЗаданийПакетов.ВременнаяМеткаСобытия < &ВременнаяМеткаСобытия";
	
	Запрос.УстановитьПараметр("ВременнаяМеткаСобытия", МеткаВремениОчистки);
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат; // Нет данных для очистки, создавать пакет не нужно
	КонецЕсли;
	
	ЗапросСпособа = Новый Запрос;
	ЗапросСпособа.Текст =
		"ВЫБРАТЬ
		|	ум_СпособыОбработкиПакетов.Ссылка КАК Ссылка,
		|	ум_СпособыОбработкиПакетов.ИмяФункции КАК ИмяФункции
		|ИЗ
		|	Справочник.ум_СпособыОбработкиПакетов КАК ум_СпособыОбработкиПакетов
		|ГДЕ
		|	ум_СпособыОбработкиПакетов.ИмяПредопределенныхДанных = &ИмяПредопределенныхДанных";
	
	ЗапросСпособа.УстановитьПараметр("ИмяПредопределенныхДанных", "ОчисткаЛоговФЗ");
	ВыборкаСпособа = ЗапросСпособа.Выполнить().Выбрать();
	
	Если Не ВыборкаСпособа.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	СпособОбработки = ВыборкаСпособа.Ссылка;
	
	Если Не ЗначениеЗаполнено(ВыборкаСпособа.ИмяФункции) Тогда
		СпособОбработкиОбъект = СпособОбработки.ПолучитьОбъект();
		СпособОбработкиОбъект.ИмяФункции = "ум_ЛогированиеПакетыДанных.СпособОбработкиОчисткаЛоговФЗ";
		СпособОбработкиОбъект.Записать();											
	КонецЕсли; 
	
	ДатаОчистки = ТекущаяДатаСеанса() - ПараметрыУдаленияЛоговФЗ.ТаймаутУдаленияЛоговФЗ * 3600;
	ПараметрыОчистки = Новый Структура("ДатаУдаления", ДатаОчистки);
	
	ум_ПакетыДанных.СоздатьПакетДанных(
		ПараметрыОчистки,
		СпособОбработки,
		Неопределено,
		"Удаление логов ФЗ на " + ДатаОчистки,
		""
	);

КонецПроцедуры

#КонецОбласти // РегламентноеУдалениеПакетов
